# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) 


a = int(input("Введите трехзначное число: "))
while a > 999 or a < 100:
    print("Введите трехзначное число:")
    a = int(input())
# n1 = a % 10
# n2 = a // 10 % 10
# n3 = a // 100
# total = n1+n2+n3
# print(total)

n1 = a // 10 ** 0 % 10
n2 = a // 10 ** 1 % 10
n3 = a // 10 ** 2 % 10
print(n1 + n2 + n3)