# Задача 12
# Помогите Кате отгадать задуманные Петей числа.


s = int(input("Введите сумму двух чисел: "))
p = int(input("Введите произведение двух чисел: "))
с = 0
for i in range(s):
     for j in range(s):
         if i + j == s and i * j == p:
            print(f" Загадали числа {i} и {j}")
            с = 1
            break
if с == 0:
     print("Таких чисел не сущствует")
